Revit 2027 API
BuiltInFailures.EditingFailures.ExtendToOthersWarn Property
 Can't keep [Type Name] extended to [Type Name].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ExtendToOthersWarn { get; }
Public Shared ReadOnly Property ExtendToOthersWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ExtendToOthersWarn {
	FailureDefinitionId^ get ();
}
static member ExtendToOthersWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace